openEuler-test/2303previewV1/logs/fio/oe_test_fio_002/2023-04-05-11:45:56.log
+ source ./common/disk_lib.sh
++ source /root/GitRepo/mugen/libs/locallibs/common_lib.sh
+++ python3 --version
+++ '[' 0 -eq 0 ']'
+++ source /root/GitRepo/mugen/libs/locallibs/common_lib_python.sh
+ main
++ type -t post_test
+ '[' -n function ']'
+ trap post_test EXIT INT HUP TERM
+ rpm -qa
+ grep expect
++ type -t config_params
+ '[' -n '' ']'
++ type -t pre_test
+ '[' -n function ']'
+ pre_test
+ LOG_INFO 'Start to prepare the test environment!'
+ message='Start to prepare the test environment!'
+ python3 /root/GitRepo/mugen/libs/locallibs/mugen_log.py --level info --message 'Start to prepare the test environment!'
Wed Apr  5 11:46:00 2023 - INFO  - Start to prepare the test environment!
+ check_free_disk
++ TEST_DISK
++ id=1
++ python3 /root/GitRepo/mugen/libs/locallibs/get_test_device.py --device disk --node 1
+ disks=vdb
+ disk_list=($disks)
+ local_disk=vdb
+ local_disk1=
+ local_disk2=
+ local_disk3=
+ DNF_INSTALL fio
+ pkgs=fio
+ node=1
+ '[' -z '' ']'
+ tmpfile=
++ python3 /root/GitRepo/mugen/libs/locallibs/rpm_manage.py install --pkgs fio --node 1 --tempfile ''
+ tmpfile2=/tmp/tmppfqaf585
+ '[' -z '' ']'
+ tmpfile=/tmp/tmppfqaf585
+ test -f test.txt
+ touch test.txt
+ LOG_INFO 'End to prepare the test environment!'
+ message='End to prepare the test environment!'
+ python3 /root/GitRepo/mugen/libs/locallibs/mugen_log.py --level info --message 'End to prepare the test environment!'
Wed Apr  5 11:46:39 2023 - INFO  - End to prepare the test environment!
++ type -t run_test
+ '[' -n function ']'
+ run_test
+ LOG_INFO 'Start executing testcase!'
+ message='Start executing testcase!'
+ python3 /root/GitRepo/mugen/libs/locallibs/mugen_log.py --level info --message 'Start executing testcase!'
Wed Apr  5 11:46:39 2023 - INFO  - Start executing testcase!
+ fio-dedupe -o 1 /dev/vdb
+ grep 'items processed'
Threads(4): 128000 items processed
+ CHECK_RESULT 0 0 0 'fio-dedupe -o option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -o option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ grep 'items processed'
+ fio-dedupe -c 1 /dev/
pread: Is a directory
Threads(4): 0 items processed
+ CHECK_RESULT 0 0 0 'fio-dedupe -c option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -c option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio-dedupe -B 1 /dev/
Will check </dev/>, size <12288>, using 4 threads
pread: Is a directory
Threads(4): 0 items processed
Extents=0, Unique extents=18446744073709551615
De-dupe ratio: 1:-1.00
Fio setting: dedupe_percentage=2147483648
+ CHECK_RESULT 0 0 0 'fio-dedupe -B option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -B option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio-dedupe -p 1 /dev/
Will check </dev/>, size <12288>, using 4 threads
pread: Is a directory
Threads(4): 0 items processed
Extents=0, Unique extents=18446744073709551615
De-dupe ratio: 1:-1.00
Fio setting: dedupe_percentage=2147483648
+ CHECK_RESULT 0 0 0 'fio-dedupe -p option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -p option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio --filename=test_file --direct=1 --rw=randwrite --numjobs=1 --iodepth=16 --ioengine=libaio --bs=4k --group_reporting --name=zhangyi --log_avg_msec=500 --write_bw_log=test-fio --size=1G
zhangyi: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.32
Starting 1 process
zhangyi: Laying out IO file (1 file / 1024MiB)

zhangyi: (groupid=0, jobs=1): err= 0: pid=2180: Wed Apr  5 11:48:49 2023
  write: IOPS=2059, BW=8237KiB/s (8434kB/s)(1024MiB/127306msec); 0 zone resets
    slat (usec): min=169, max=115224, avg=266.07, stdev=371.12
    clat (usec): min=312, max=134976, avg=7437.51, stdev=2574.06
     lat (usec): min=631, max=135575, avg=7703.59, stdev=2622.22
    clat percentiles (msec):
     |  1.00th=[    7],  5.00th=[    7], 10.00th=[    7], 20.00th=[    7],
     | 30.00th=[    7], 40.00th=[    7], 50.00th=[    7], 60.00th=[    8],
     | 70.00th=[    8], 80.00th=[    8], 90.00th=[    9], 95.00th=[   11],
     | 99.00th=[   15], 99.50th=[   20], 99.90th=[   40], 99.95th=[   44],
     | 99.99th=[  126]
   bw (  KiB/s): min= 5402, max= 9208, per=100.00%, avg=8242.03, stdev=580.31, samples=253
   iops        : min= 1352, max= 2302, avg=2060.30, stdev=145.01, samples=253
  lat (usec)   : 500=0.01%, 750=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=94.30%, 20=5.24%, 50=0.43%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=11.46%, sys=58.94%, ctx=262179, majf=0, minf=9
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,262144,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=8237KiB/s (8434kB/s), 8237KiB/s-8237KiB/s (8434kB/s-8434kB/s), io=1024MiB (1074MB), run=127306-127306msec

Disk stats (read/write):
  vda: ios=0/267470, merge=0/35884, ticks=0/81922, in_queue=83970, util=99.68%
+ CHECK_RESULT 0 0 0 'fio --filename=test_file option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio --filename=test_file option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio -filename=/dev/vdb -direct=1 -iodepth 1 -thread -rw=read -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
+ grep vdb
  vdb: ios=959741/0, merge=0/0, ticks=84594/0, in_queue=84594, util=98.82%
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ grep vdb
+ fio -filename=/dev/vdb -direct=1 -iodepth 1 -thread -rw=write -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
  vdb: ios=464/959551, merge=0/0, ticks=49/137039, in_queue=137088, util=99.74%
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio -filename=/dev/vdb -direct=1 -iodepth 1 -thread -rw=randread -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
mytest: (g=0): rw=randread, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=psync, iodepth=1
...
fio-3.32
Starting 30 threads

mytest: (groupid=0, jobs=30): err= 0: pid=3072: Wed Apr  5 11:50:42 2023
  read: IOPS=27.2k, BW=424MiB/s (445MB/s)(14.6GiB/35341msec)
    clat (usec): min=68, max=378295, avg=980.83, stdev=2000.95
     lat (usec): min=69, max=378298, avg=983.29, stdev=2003.98
    clat percentiles (usec):
     |  1.00th=[  141],  5.00th=[  260], 10.00th=[  379], 20.00th=[  519],
     | 30.00th=[  611], 40.00th=[  693], 50.00th=[  775], 60.00th=[  865],
     | 70.00th=[  979], 80.00th=[ 1139], 90.00th=[ 1450], 95.00th=[ 1958],
     | 99.00th=[ 5014], 99.50th=[ 7111], 99.90th=[19530], 99.95th=[29754],
     | 99.99th=[73925]
   bw (  KiB/s): min=112535, max=1061249, per=100.00%, avg=472666.53, stdev=6880.11, samples=1899
   iops        : min= 7018, max=66315, avg=29527.71, stdev=430.00, samples=1899
  lat (usec)   : 100=0.09%, 250=4.59%, 500=13.68%, 750=29.10%, 1000=24.22%
  lat (msec)   : 2=23.57%, 4=3.29%, 10=1.19%, 20=0.18%, 50=0.08%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=2.98%, sys=10.52%, ctx=950870, majf=0, minf=120
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=960000,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=424MiB/s (445MB/s), 424MiB/s-424MiB/s (445MB/s-445MB/s), io=14.6GiB (15.7GB), run=35341-35341msec

Disk stats (read/write):
  vdb: ios=958347/0, merge=0/0, ticks=108898/0, in_queue=108898, util=99.65%
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio -filename=/dev/vdb -direct=1 -iodepth 1 -thread -rw=randwrite -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
+ grep vdb
  vdb: ios=473/959304, merge=0/0, ticks=53/134582, in_queue=134636, util=99.60%
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio -filename=/dev/vdb -direct=1 -iodepth 1 -thread -rw=read -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest --output test.txt
+ test -f test.txt
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ genfio -d /dev/vdb,/dev/,/dev/ -a -b 4k,128k,1m -r 100 -a -x dellr720-day2/
Generating dellr720-day2/openeuler-riscv64-4k,128k,1m-all-write,randwrite,read,randread-vdb,dev,dev.fio
Estimated Time = 4800 seconds : 1 hour 20 minutes
+ test -d dellr720-day2
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ genfio -h
+ grep -i usage
usage of genfio:
+ CHECK_RESULT 0 0 0 'genfio -h option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='genfio -h option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ LOG_INFO 'End of testcase execution!'
+ message='End of testcase execution!'
+ python3 /root/GitRepo/mugen/libs/locallibs/mugen_log.py --level info --message 'End of testcase execution!'
Wed Apr  5 11:52:19 2023 - INFO  - End of testcase execution!
+ CASE_RESULT 0
+ case_re=0
+ test -z ''
+ test 0 -eq 0
+ LOG_INFO 'succeed to execute the case.'
+ message='succeed to execute the case.'
+ python3 /root/GitRepo/mugen/libs/locallibs/mugen_log.py --level info --message 'succeed to execute the case.'
Wed Apr  5 11:52:20 2023 - INFO  - succeed to execute the case.
+ exec_result=
+ exit 0
+ post_test
+ LOG_INFO 'Start environment cleanup.'
+ message='Start environment cleanup.'
+ python3 /root/GitRepo/mugen/libs/locallibs/mugen_log.py --level info --message 'Start environment cleanup.'
Wed Apr  5 11:52:21 2023 - INFO  - Start environment cleanup.
+ rm -rf test-fio_bw.1.log test.txt test_file dellr720-day2
+ DNF_REMOVE
+ node=1
+ pkg_list=
+ mode=0
+ [[ -z /tmp/tmppfqaf585 ]]
+ '[' 0 -ne 0 ']'
+ '[' 1 == 0 ']'
+ python3 /root/GitRepo/mugen/libs/locallibs/rpm_manage.py remove --node 1 --pkgs '' --tempfile /tmp/tmppfqaf585
+ '[' 0 -ne 0 ']'
+ LOG_INFO 'Finish environment cleanup.'
+ message='Finish environment cleanup.'
+ python3 /root/GitRepo/mugen/libs/locallibs/mugen_log.py --level info --message 'Finish environment cleanup.'
Wed Apr  5 11:52:32 2023 - INFO  - Finish environment cleanup.